In [12]:
# https://thecleverprogrammer.com/2022/01/08/best-approaches-for-time-series-analysis/

In [13]:
# ARIMA 
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline

In [14]:
df=pd.read_csv('https://raw.githubusercontent.com/krishnaik06/ARIMA-And-Seasonal-ARIMA/master/perrin-freres-monthly-champagne-.csv')

In [15]:
df.head()

     Month  Perrin Freres monthly champagne sales millions ?64-?72
0  1964-01                                             2815.0
1  1964-02                                             2672.0
2  1964-03                                             2755.0
3  1964-04                                             2721.0
4  1964-05                                             2946.0

In [16]:
## Change the Column Names 
df.columns=["Month","Sales"]
df.head()

     Month   Sales
0  1964-01  2815.0
1  1964-02  2672.0
2  1964-03  2755.0
3  1964-04  2721.0
4  1964-05  2946.0

In [17]:
df.tail()

                                                 Month   Sales
102                                            1972-07  4298.0
103                                            1972-08  1413.0
104                                            1972-09  5877.0
105                                                NaN     NaN
106  Perrin Freres monthly champagne sales millions...     NaN

In [18]:
## Drop last 2 rows
df.drop(106,axis=0,inplace=True)

In [19]:
# df.tail()

In [20]:
df.drop(105,axis=0,inplace=True)

In [21]:
# Convert Month into Datetime
df['Month']=pd.to_datetime(df['Month'])